In [1]:
중간고사 = [34, 30, 26, 40, 33, 15, 31, 21, 17, 40]
기말고사 = [45, 48, 25, 50, 50, 28, 39, 33, 47, 42]
과제 = [5, 10, 8, 10, 10, 7, 7, 9, 10, 2]

In [2]:
total =[]
for i in zip(중간고사,기말고사,과제):
    total.append(i[0]+i[1]+i[2])
total.sort(reverse= True)
print(total)

In [3]:
sn = input('지원번호를 입력하세요: ')
if sn[3] == '1'or sn[3] == '3':
    print('성별: 남')
else:
    print('성별: 여')
N = 0
if sn[2]== '1' or sn[2]=='2':
    print(f"기수: {(int(sn[:2])-18)*2 +int( sn[3])}")
    print("편입: x")
else:
    print(f"기수: {(int(sn[:2])-18)*2 +int( sn[3])-1}")
    print("편입: o")
if 's' in sn:
    print("운영진: o")
else:
    print('운영진: x')

지원번호를 입력하세요: 202013
성별: 여
기수: 4
편입: x
운영진: x

In [4]:
import pandas as pd
import numpy as np

In [5]:
titanic = pd.read_csv("C:/Users/82109/data_setting/data/train.csv",encoding='cp949')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# loc,iloc 둘중하나 무조건 사용, 컬럼만 가져올거기 때문에 :, []
df = titanic.loc[:,['Pclass','Age','Fare']][:101]
df.head()

   Pclass   Age     Fare
0       3  22.0   7.2500
1       1  38.0  71.2833
2       3  26.0   7.9250
3       1  35.0  53.1000
4       3  35.0   8.0500

In [7]:
df.drop('Pclass',axis= 1, inplace=True)
df.head()

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [8]:
df[df.isnull()].sum()

Age     0.0
Fare    0.0
dtype: float64

In [9]:
#bfill >>> 인덱스 +1 과 똑같은 값으로 채워져.
df.bfill(inplace =True)

In [10]:
df[df['Age']>= 40].sort_values(by = 'Age',ascending =False)

     Age      Fare
96  71.0   34.6542
95  71.0    8.0500
31  66.0  146.5208
32  66.0    7.7500
33  66.0   10.5000
54  65.0   61.9792
94  59.0    7.2500
11  58.0   26.5500
15  55.0   16.0000
6   54.0   51.8625
5   54.0    8.4583
52  49.0   76.7292
92  46.0   61.1750
62  45.0   83.4750
35  42.0   52.0000
29  40.0    7.8958
30  40.0   27.7208
28  40.0    7.8792
40  40.0    9.4750

In [11]:
# df.Fare = df['Fare'].apply(lambda x: (x-x.mean())/x.std())
# df.Fare

In [17]:
mean = df['Fare'].mean()
std = df['Fare'].std()
df.Fare = df['Fare'].apply(lambda x: (x-mean)/std)
df.Fare

0     -0.540207
1      1.028304
2     -0.523673
3      0.582900
4     -0.520611
         ...
96     0.131066
97     0.834179
98    -0.154407
99    -0.080921
100   -0.524388
Name: Fare, Length: 101, dtype: float64

In [21]:
# 시리즈는 슬라이싱 할 수 없기 떄
Names = titanic['Name']
Names.tolist()
First_names = []
for Name in Names:
    Firts_name = Name.split(',')[0]
    First_names.append(Firts_name)
titanic['First_Name'] = First_names
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,First_Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen